tap "artginzburg/tap"
tap "austinliuigi/brew-neovim-nightly", "https://github.com/austinliuigi/brew-neovim-nightly"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "shaunsingh/sfmono-nerd-font-ligaturized"

brew "artginzburg/tap/sudo-touchid"
brew "asitop"
brew "bash"
brew "bat"
brew "clang-format"
brew "curl"
brew "duckdb"
brew "duf"
brew "dust"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "git-lfs"
brew "htop"
brew "hyperfine"
brew "jless"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "magic-wormhole.rs"
brew "mdcat"
brew "pixi"
brew "pre-commit"
brew "pv"
brew "pwgen"
brew "ripgrep"
brew "rm-improved"
brew "rsync"
brew "ruff"
brew "rustup-init"
brew "sccache"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "stylua"
brew "tmux"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zstd"

cask "alt-tab"
cask "arc"
cask "avifquicklook"
cask "betterdisplay"
cask "chatbox"
cask "dash"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "fork"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "keyboardcleantool"
cask "neovim-nightly"
cask "orbstack"
cask "qlimagesize"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "slack"
cask "sloth"
cask "syntax-highlight"
cask "tad"
cask "the-unarchiver"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
