tap "austinliuigi/brew-neovim-nightly", "https://github.com/austinliuigi/brew-neovim-nightly"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

brew "bash"
brew "bat"
brew "caddy"
brew "curl"
brew "duckdb"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "htop"
brew "jless"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "less"
brew "make"
brew "micromamba"
brew "mypy"
brew "ouch"
brew "pixi"
brew "pre-commit"
brew "pv"
brew "pwgen"
brew "ripgrep"
brew "rm-improved"
brew "ruff"
brew "rustup-init"
brew "sccache"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "stylua"
brew "tmux"
brew "wget"
brew "yq"
brew "zoxide"
cask "alt-tab"
cask "betterdisplay"
cask "dash"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "microsoft-edge"
cask "neovim-nightly"
cask "orbstack"
cask "rectangle"
